chalupec/nRF9160_Examples/mqtt_working/src/main.c
static void timer_handler(nrf_timer_event_t event_type, void *p_context)
{
	if (event_type == NRF_TIMER_EVENT_COMPARE0)
	{
		ADC_SAMPLE_FLAG = 1;
	}
}

LOG_MODULE_REGISTER(LIS, LOG_LEVEL_INF); // Lesson4_Exercise1

static void lte_handler(const struct lte_lc_evt *const evt)
{
	switch (evt->type)
	{
	case LTE_LC_EVT_NW_REG_STATUS:
		if ((evt->nw_reg_status != LTE_LC_NW_REG_REGISTERED_HOME) &&
			(evt->nw_reg_status != LTE_LC_NW_REG_REGISTERED_ROAMING))
		{
			break;
		}
		LOG_INF("Network registration status: %s",
				evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME ? "Connected - home network" : "Connected - roaming");
		k_sem_give(&lte_connected);
		break;
	case LTE_LC_EVT_RRC_UPDATE:
		LOG_INF("RRC mode: %s", evt->rrc_mode == LTE_LC_RRC_MODE_CONNECTED ? "Connected" : "Idle");
		break;
	default:
		break;
	}
}

static int modem_configure(void)
{
	int err;

	LOG_INF("Initializing modem library");
	err = nrf_modem_lib_init();
	if (err)
	{
		LOG_ERR("Failed to initialize the modem library, error: %d", err);
		return err;
	}

	LOG_INF("Connecting to LTE network");
	err = lte_lc_connect_async(lte_handler);
	if (err)
	{
		LOG_ERR("Error in lte_lc_connect_async, error: %d", err);
		return err;
	}

	k_sem_take(&lte_connected, K_FOREVER);
	LOG_INF("Connected to LTE network");
	dk_set_led_on(DK_LED2);

	return 0;
}

void send_multiple_packets(uint16_t total_packet_to_send)
{

	uint16_t pckt_cnt = 1;

	while (pckt_cnt <= total_packet_to_send)
	{
		seed_packet.packet_header = 0xBEEF;
		seed_packet.packet_version = 0x0101;
		seed_packet.actual_packet_nr = pckt_cnt++;
		seed_packet.total_packet_nr = total_packet_to_send;

		seed_packet.timestamp = 1748277406;
		seed_packet.train_counter = train_counter;

		seed_packet.CRC = 0xABCD;
		/*
				memcpy(seed_packet.chan_0_vlt, chan_dat, 64);
				memcpy(seed_packet.chan_1_vlt, chan_dat, 16);
				memcpy(seed_packet.chan_0_int, chan_dat_128, 128);
				memcpy(seed_packet.chan_1_int, &chan_dat_128[10], 50);
		*/
		uint16_t sizestruct = sizeof(seed_packet);
		//	LOG_INF("size of struct is: %d", sizestruct);
		uint8_t *byte_ptr = (uint8_t *)&seed_packet;

		//	int err = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE,
		//						   byte_ptr, sizestruct);

		int err = data_publish(&client, MQTT_QOS_0_AT_MOST_ONCE,
							   byte_ptr, sizestruct);

		if (err)
		{
			LOG_INF("Failed to send message, %d", err);
			return;
		}
	}
	train_counter++;
}

void send_measured_train_data_with_multiple_packets(void)
{
	uint16_t pckt_cnt = 1;
	uint16_t total_packet_to_send = 0;
	uint16_t array_offset = 0;

	total_packet_to_send = total_recorded_samples / WAVE_SAMPLE_LEN;
	total_packet_to_send++;

	while (pckt_cnt <= total_packet_to_send)
	{
		seed_packet.packet_header = 0xBEEF;
		seed_packet.packet_version = 0x0101;
		seed_packet.actual_packet_nr = pckt_cnt++;
		seed_packet.total_packet_nr = total_packet_to_send;

		seed_packet.timestamp = 1748277406;
		seed_packet.train_counter = train_counter;

		seed_packet.CRC = 0xABCD;

		memcpy(seed_packet.chan_0_vlt, &ch0_volt[array_offset], WAVE_SAMPLE_LEN * 2);
		memcpy(seed_packet.chan_1_vlt, &ch1_volt[array_offset], WAVE_SAMPLE_LEN * 2);
		memcpy(seed_packet.chan_0_int, &ch0_int[array_offset], WAVE_SAMPLE_LEN * 2);
		memcpy(seed_packet.chan_1_int, &ch1_int[array_offset], WAVE_SAMPLE_LEN * 2);

		array_offset = array_offset + WAVE_SAMPLE_LEN;

		uint16_t sizestruct = sizeof(seed_packet);
		//	LOG_INF("size of struct is: %d", sizestruct);
		uint8_t *byte_ptr = (uint8_t *)&seed_packet;

		int err = 0;
		//	err = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE,
		//						   byte_ptr, sizestruct);

		err = data_publish(&client, MQTT_QOS_0_AT_MOST_ONCE,
						   byte_ptr, sizestruct);

		if (err)
		{
			LOG_INF("Failed to send message, %d", err);
			return;
		}
	}
	train_counter++;
}

void send_measured_train_data_with_multiple_packets_from_flash(void)
{
	uint16_t pckt_cnt = 1;
	uint16_t total_packet_to_send = 0;
	uint16_t array_offset = 0;
	uint16_t samples_to_load_cntr = 0;
	uint16_t fl_buff_bcnt = 0;

	crc_err_counter = 0;
	flash_sample_fail_counter = 0;

	total_packet_to_send = total_recorded_samples / WAVE_SAMPLE_LEN;
	if (circ_buff_overflow == 1)
	{
		total_packet_to_send++;
	}

	flash_address_read = 0;
	while (pckt_cnt <= total_packet_to_send)
	{
		seed_packet.packet_header = 0xBEEF;
		seed_packet.packet_version = 0x0101;
		seed_packet.actual_packet_nr = pckt_cnt++;
		seed_packet.total_packet_nr = total_packet_to_send;
		seed_packet.timestamp = record_unix_time_s;
		seed_packet.train_counter = train_counter;
		seed_packet.CRC = 0xABCD;

		if (circ_buff_overflow == 1)
		{ // circ_buff_overflow occured then use buffered data, than use psram data
			circ_buff_overflow = 0;

			uint16_t temp_head;
			uint16_t temp_tail;

			temp_head = last_circ_buff_record;
			temp_tail = CRCLR_BUFF_SIZE - last_circ_buff_record;

			LOG_INF("cicr buff ovrflw, aligning result");
			LOG_INF("buff head: %d, tail: %d", temp_head, temp_tail);

			if (temp_tail == 0)
			{
				memcpy(seed_packet.chan_0_vlt, circ_buff_ch0, CRCLR_BUFF_SIZE * 2);
				memcpy(seed_packet.chan_0_int, circ_buff_ch1, CRCLR_BUFF_SIZE * 2);
				memcpy(seed_packet.chan_1_vlt, circ_buff_ch2, CRCLR_BUFF_SIZE * 2);
				memcpy(seed_packet.chan_1_int, circ_buff_ch3, CRCLR_BUFF_SIZE * 2);
			}
			else
			{
				memcpy(seed_packet.chan_0_vlt, &circ_buff_ch0[temp_head], temp_tail * 2);
				memcpy(seed_packet.chan_0_int, &circ_buff_ch1[temp_head], temp_tail * 2);
				memcpy(seed_packet.chan_1_vlt, &circ_buff_ch2[temp_head], temp_tail * 2);
				memcpy(seed_packet.chan_1_int, &circ_buff_ch3[temp_head], temp_tail * 2);

				memcpy(&seed_packet.chan_0_vlt[temp_tail], circ_buff_ch0, temp_head * 2);
				memcpy(&seed_packet.chan_0_int[temp_tail], circ_buff_ch1, temp_head * 2);
				memcpy(&seed_packet.chan_1_vlt[temp_tail], circ_buff_ch2, temp_head * 2);
				memcpy(&seed_packet.chan_1_int[temp_tail], circ_buff_ch3, temp_head * 2);
			}
		}
		else
		{
			samples_to_load_cntr = 0;

			while (samples_to_load_cntr < WAVE_SAMPLE_LEN)
			{

