chalupec/nRF9160_Examples/mqtt_working/src/main.c
void test_flash(void)
{
	flash_write_buffer_byte[0] = 1;
	flash_write_buffer_byte[1] = 2;

	flash_write_buffer_byte[2] = 3;
	flash_write_buffer_byte[3] = 4;

	flash_write_buffer_byte[4] = 5;
	flash_write_buffer_byte[5] = 6;

	flash_write_buffer_byte[6] = 7;
	flash_write_buffer_byte[7] = 8;
	FLASH_MEMORY_WRITE_BYTE_ARRAY(flash_address_write, flash_write_buffer_byte, 8); // cca 20-40 us?

	k_sleep(K_MSEC(5));

	FLASH_MEMORY_READ_DATA(flash_address_write, flash_read_buffer_byte, 8);

	LOG_INF("data %d \t %d", flash_read_buffer_byte[0], flash_read_buffer_byte[1]);
	LOG_INF("data %d \t %d", flash_read_buffer_byte[2], flash_read_buffer_byte[3]);
	LOG_INF("data %d \t %d", flash_read_buffer_byte[4], flash_read_buffer_byte[5]);
	LOG_INF("data %d \t %d", flash_read_buffer_byte[6], flash_read_buffer_byte[7]);

	flash_address_write += 8;
	k_sleep(K_MSEC(100));
}

int main(void)
{

	uint32_t record_cnt = 1780;

	nrfx_err_t status;
	(void)status;

	k_sleep(K_MSEC(500));
	printk("\nSAMPLE APP STARTS\n");
	k_sleep(K_MSEC(500));

#if defined(__ZEPHYR__)
	IRQ_CONNECT(NRFX_IRQ_NUMBER_GET(NRF_TIMER_INST_GET(TIMER_INST_IDX)), IRQ_PRIO_LOWEST, NRFX_TIMER_INST_HANDLER_GET(TIMER_INST_IDX), 0, 0);
#endif

	k_sleep(K_MSEC(500));
	printk("SPIM INIT\n");
	k_sleep(K_MSEC(500));

	nrfx_spim_config_t spim_config = NRFX_SPIM_DEFAULT_CONFIG(SCK_PIN,
															  MOSI_PIN,
															  MISO_PIN,
															  MEM_CS_PIN);

	spim_config.frequency = 8000000;
	spim_config.irq_priority = 2;

	status = nrfx_spim_init(&spim_inst, &spim_config, NULL, NULL);
	// NRFX_ASSERT(status == NRFX_SUCCESS);

	k_sleep(K_MSEC(500));
	printk("SPIM INIT finished\n");
	k_sleep(K_MSEC(500));

	uint8_t wr_buff[32];
	uint8_t rd_buff[32];
	uint8_t cntradd = 0;

	int handle = 0;
	int ret = 0;

	nrfx_timer_t timer_inst = NRFX_TIMER_INSTANCE(TIMER_INST_IDX);
	uint32_t base_frequency = NRF_TIMER_BASE_FREQUENCY_GET(timer_inst.p_reg);
	nrfx_timer_config_t config = NRFX_TIMER_DEFAULT_CONFIG(base_frequency);
	config.bit_width = NRF_TIMER_BIT_WIDTH_32;
	config.p_context = "Some context";
	// config.interrupt_priority=20;

	status = nrfx_timer_init(&timer_inst, &config, timer_handler);
	NRFX_ASSERT(status == NRFX_SUCCESS);

	nrfx_timer_clear(&timer_inst);
	uint32_t desired_ticks = nrfx_timer_us_to_ticks(&timer_inst, TIME_TO_WAIT_US);
	nrfx_timer_extended_compare(&timer_inst, NRF_TIMER_CC_CHANNEL0, desired_ticks,
								NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

	k_sleep(K_MSEC(500));

	// printk("\nSAMPLE APP STARTS\n");

	if (dk_leds_init() != 0)
	{
		LOG_ERR("Failed to initialize the LED library");
	}

	if (!device_is_ready(adc_dev))
	{
		printk("ADC not ready\n");
		return;
	}

	adc_channel_setup(adc_dev, &channel_cfg_0);
	adc_channel_setup(adc_dev, &channel_cfg_1);
	adc_channel_setup(adc_dev, &channel_cfg_2);
	adc_channel_setup(adc_dev, &channel_cfg_3);
	adc_channel_setup(adc_dev, &channel_cfg_4);

	rec_counter = 0;
	int16_t sample_print = 0;
	int16_t sample_buffer2[4] = {0};

	int16_t sample_solve_rms = 0;

	int32_t filtered_value_array[4] = {5200, 5200, 5200, 5200};
	int32_t filtered_value = 5200;
	int32_t temp_value = 5200;
	int32_t new_sample;

	int16_t offsets[4];
	uint8_t chsel = 0;

	uint16_t offset_gather_cnt = 200;

	while (0) {test_flash();}

	if (1)
	{
		LOG_INF("-----------------------------");
		LOG_INF("<---- REMOTE CONFIG STAGE --->");
		LOG_INF("first modem init");
		init_modem_and_mqtt();
		LOG_INF("--entering MQTT pooling loop--");
		while (1)
		{
			pool_retval = mqtt_pooling_procedure();
			if (pool_retval == -1)
			{
				break;
			}
		}
		connect_attempt = 0;
		LOG_INF("leaving  INIT STAGE");
		LOG_INF("-----------------------------");
	}
	else
	{
		first_alive_flag = 0;
	}

	LOG_INF("<----MEASUREMENT STAGE --->");
	LOG_INF("starting timer");
	k_sleep(K_MSEC(100));
	nrfx_timer_enable(&timer_inst);
	k_sleep(K_MSEC(100));
	LOG_INF("gathering offsets");

	while (offset_gather_cnt--)
	{
		while (ADC_SAMPLE_FLAG == 0)
		{
			// wait
		}
		if (ADC_SAMPLE_FLAG == 1)
		{
			// gpio_pin_set_dt(&led0, 1);
			ADC_SAMPLE_FLAG = 0;
			adc_read(adc_dev, &sequence);				   // takes 248 us
			add_samples_to_buffer(sample_buffer, &buffer); // takes 2 us
			average_of_vectors(buffer, &sample_buffer2);   // 3.5 us

			chsel = 0;
			while (chsel < 4)
			{
				filtered_value = filtered_value_array[chsel];
				temp_value = sample_buffer2[chsel];
				filtered_value = exponential_filter(filtered_value, temp_value);
				filtered_value_array[chsel] = filtered_value;
				chsel++;
			}
		}
	}
	offsets[0] = filtered_value_array[0];
	offsets[1] = filtered_value_array[1];
	offsets[2] = filtered_value_array[2];
	offsets[3] = filtered_value_array[3];

	LOG_INF("offsets done");

	buff_head = 0;
	total_recorded_samples = 0;

	int16_t cntrval = 0;

	LOG_INF("circular buffer init");
	circular_buffer_init();
	LOG_INF("entering trigger waiting loop");

	while (1) // waiting for trigger
	{
		if (ADC_SAMPLE_FLAG == 1)
		{
			// gpio_pin_set_dt(&led0, 1);
			ADC_SAMPLE_FLAG = 0;
			adc_read(adc_dev, &sequence);				   // takes 248 us
			add_samples_to_buffer(sample_buffer, &buffer); // takes 2 us
			average_of_vectors(buffer, &sample_buffer2);   // 3.5 us

			new_sample = sample_buffer2[0] - offsets[0]; // Replace with actual sensor/ADC reading
			ch0_off_value = new_sample;
			rms_value[0] = update_rms(buffer_rms_ch0, &indexx, &sum_squares_ch0, new_sample);

			new_sample = sample_buffer2[1] - offsets[1]; // Replace with actual sensor/ADC reading
			ch1_off_value = new_sample;
			rms_value[1] = update_rms(buffer_rms_ch1, &indexx, &sum_squares_ch1, new_sample);

			new_sample = sample_buffer2[2] - offsets[2]; // Replace with actual sensor/ADC reading
			ch2_off_value = new_sample;
			rms_value[2] = update_rms(buffer_rms_ch2, &indexx, &sum_squares_ch2, new_sample);

			new_sample = sample_buffer2[3] - offsets[3]; // Replace with actual sensor/ADC reading
			ch3_off_value = new_sample;
			rms_value[3] = update_rms(buffer_rms_ch3, &indexx, &sum_squares_ch3, new_sample);

			saturate_channel_values(&ch0_off_value, &ch1_off_value, &ch2_off_value, &ch3_off_value);

			last_circ_buff_record = circular_buffer_add_value(ch0_off_value, ch1_off_value, ch2_off_value, ch3_off_value);

#ifdef SAMPLE_PRINTING_ENABLED
			if (sample_print >= 3)
			{
				sample_print = 0;

				printk("%d, %d, %d, %d\n",
					   ch0_off_value,
					   ch1_off_value,
					   ch2_off_value,
					   ch3_off_value);
			}
			sample_print++;
#endif
		}

