chalupec/nRF9160_Examples/mqtt_working/src/main.c
		if ((rms_value[0] > RMS_TRIG_TRESHOLD) || (rms_value[2] > RMS_TRIG_TRESHOLD))
		{
			LOG_INF("treshold crossed");
			uint16_t sample_cntr = 0;

			if (circ_buff_overflow == 1)
			{
				sample_cntr = CRCLR_BUFF_SIZE;
			}
			else
			{
				sample_cntr = last_circ_buff_record;
			}

			total_recorded_samples = sample_cntr;

			flash_address_write = 0;

			rms_low_counter_to_end = 0;

			trigger_measurement_end = 0;

			while (1)
			{
				if (ADC_SAMPLE_FLAG == 1)
				{
					// gpio_pin_set_dt(&led0, 1);
					ADC_SAMPLE_FLAG = 0;
					adc_read(adc_dev, &sequence);				   // takes 248 us
					add_samples_to_buffer(sample_buffer, &buffer); // takes 2 us
					average_of_vectors(buffer, &sample_buffer2);   // 3.5 us

					new_sample = sample_buffer2[0] - offsets[0]; // Replace with actual sensor/ADC reading
					ch0_off_value = new_sample;
					rms_value[0] = update_rms(buffer_rms_ch0, &indexx, &sum_squares_ch0, new_sample);

					new_sample = sample_buffer2[1] - offsets[1]; // Replace with actual sensor/ADC reading
					ch1_off_value = new_sample;
					rms_value[1] = update_rms(buffer_rms_ch1, &indexx, &sum_squares_ch1, new_sample);

					new_sample = sample_buffer2[2] - offsets[2]; // Replace with actual sensor/ADC reading
					ch2_off_value = new_sample;
					rms_value[2] = update_rms(buffer_rms_ch2, &indexx, &sum_squares_ch2, new_sample);

					new_sample = sample_buffer2[3] - offsets[3]; // Replace with actual sensor/ADC reading
					ch3_off_value = new_sample;
					rms_value[3] = update_rms(buffer_rms_ch3, &indexx, &sum_squares_ch3, new_sample);

					saturate_channel_values(&ch0_off_value, &ch1_off_value, &ch2_off_value, &ch3_off_value);

					flash_write_buffer_byte[0] = ch0_off_value >> 8;
					flash_write_buffer_byte[1] = ch0_off_value & 0xff;

					flash_write_buffer_byte[2] = ch1_off_value >> 8;
					flash_write_buffer_byte[3] = ch1_off_value & 0xff;

					flash_write_buffer_byte[4] = ch2_off_value >> 8;
					flash_write_buffer_byte[5] = ch2_off_value & 0xff;

					flash_write_buffer_byte[6] = ch3_off_value >> 8;
					flash_write_buffer_byte[7] = ch3_off_value & 0xff;
					// FIXME
					////////// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!        ///////
					//	flash_write_buffer_byte[2] = rms_value[0] >> 8;	  // FIXME ONLY FOR OBSERVING RMS
					//	flash_write_buffer_byte[3] = rms_value[0] & 0xff; // FIXME ONLY FOR OBSERVING RMS
					//	flash_write_buffer_byte[6] = rms_value[2] >> 8;	  // FIXME ONLY FOR OBSERVING RMS
					//	flash_write_buffer_byte[7] = rms_value[2] & 0xff; // FIXME ONLY FOR OBSERVING RMS
					// FIXME
					////////// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!        ///////

					crc = crc16_ccitt_jch(flash_write_buffer_byte, 8);
					flash_write_buffer_byte[8] = crc >> 8;
					flash_write_buffer_byte[9] = crc & 0xff;
					FLASH_MEMORY_WRITE_BYTE_ARRAY(flash_address_write, flash_write_buffer_byte, 10); // cca 20-40 us?
					flash_address_write += 10;

					sample_cntr++;
					total_recorded_samples++;

					if ((rms_value[0] < END_RMS_TRIG_TRESHOLD) && (rms_value[2] < END_RMS_TRIG_TRESHOLD))
					{
						rms_low_counter_to_end++;
					}
					else
					{
						rms_low_counter_to_end = 0;
					}

					if (rms_low_counter_to_end > RMS_LOW_SAMPLES_TO_TRIGGER_END)
					{
						LOG_INF("end trigger - rms low");
						trigger_measurement_end = 1;
					}

					if (sample_cntr > NR_OF_SAMPLES_TO_MEASURE)
					{
						LOG_INF("end trigger - sample limit");
						trigger_measurement_end = 1;
					}

					if (trigger_measurement_end == 1)
					{
						break;
					}
				}
			}

			nrfx_timer_uninit(&timer_inst);

			uint16_t memclr_cnt = 1000;
			while (memclr_cnt--)
			{
				crc = crc16_ccitt_jch(flash_write_buffer_byte, 8);
				flash_write_buffer_byte[8] = crc >> 8;
				flash_write_buffer_byte[9] = crc & 0xff;
				FLASH_MEMORY_WRITE_BYTE_ARRAY(flash_address_write, flash_write_buffer_byte, 10); // cca 20-40 us?
				flash_address_write += 10;
			}

			uint16_t loc_circ_buf_cntr = 0;
			uint16_t mcnt = 0;
			uint16_t samples_to_store_from_circ_buff = 0;

			if (circ_buff_overflow == 1)
			{
				samples_to_store_from_circ_buff = CRCLR_BUFF_SIZE;
				loc_circ_buf_cntr = last_circ_buff_record;
			}
			else
			{
				samples_to_store_from_circ_buff = last_circ_buff_record;
				loc_circ_buf_cntr = 0;
			}

			while (mcnt < samples_to_store_from_circ_buff)
			{
				if (loc_circ_buf_cntr < CRCLR_BUFF_SIZE)
				{
					ch0_volt[mcnt] = circ_buff_ch0[loc_circ_buf_cntr];
					ch0_int[mcnt] = circ_buff_ch1[loc_circ_buf_cntr];
					ch1_volt[mcnt] = circ_buff_ch2[loc_circ_buf_cntr];
					ch1_int[mcnt] = circ_buff_ch3[loc_circ_buf_cntr];
					loc_circ_buf_cntr++;
					mcnt++;
				}
				else
				{
					loc_circ_buf_cntr = 0;
				}
			}
#ifdef CIRC_BUFF_STAMP_VALUE_ADD
			ch0_volt[samples_to_store_from_circ_buff] = ch0_volt[samples_to_store_from_circ_buff] + 5000;
			ch0_int[samples_to_store_from_circ_buff] = ch0_int[samples_to_store_from_circ_buff] + 5000;
			ch1_volt[samples_to_store_from_circ_buff] = ch1_volt[samples_to_store_from_circ_buff] + 5000;
			ch1_int[samples_to_store_from_circ_buff] = ch1_int[samples_to_store_from_circ_buff] + 5000;
#endif

			data_ready_to_send = 1;
			//	clear_buffer(circ_buff_ch0, CRCLR_BUFF_SIZE);
			//	clear_buffer(circ_buff_ch1, CRCLR_BUFF_SIZE);
			//	clear_buffer(circ_buff_ch2, CRCLR_BUFF_SIZE);
			//  clear_buffer(circ_buff_ch3, CRCLR_BUFF_SIZE);
		}

		if (data_ready_to_send == 1)
		{
			break;
		}
	}

	if (jumpto_measurement_start_enabled == 0)
	{
		init_modem_and_mqtt();
	}
	else
	{
		jumpto_measurement_start_enabled = 0;
	}

	while (1)
	{
		pool_retval = mqtt_pooling_procedure();

		if (pool_retval == -1)
		{
			break;
		}
	}

	LOG_INF("PROGRAM END Disconnecting MQTT client");

	err = mqtt_disconnect(&client);

	if (err)
	{
		LOG_ERR("Could not disconnect MQTT client: %d", err);
	}

	LOG_INF("PROGRAM END  trigg REBOOT NOW");
	k_sleep(K_MSEC(1000));
	sys_reboot(SYS_REBOOT_COLD);

	return 0;
}
